src/InformationRegisters/ТоварыВОборудовании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ТоварыВОборудовании</Name>
			<Comment>Сведения о товарах которые выгружаются в оборудование</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерЯчейки</Name>
					<Comment>Номер ячейки PLU</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МоментИзменения</Name>
					<Comment>Момент последнего изменения товара. Если момент больше чем "момент последней загрузки" оборудования, то этот товар надо выгрузить в оборудование</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВыполненаПечатьЦенников</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ГруппаТоваров</Name>
					<Comment>Группа товаров оборудования</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыТоваровОборудования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Comment>Штрих-код</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/AccumulationRegisters/ОстаткиТоваровКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТоваровКомпании</Name>
			<Comment>Блок учета остатков товаров компании</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количественный остаток номенклатуры на складе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Резерв</Name>
					<Comment>Количество зарезервированного товара на складе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРозн</Name>
					<Comment>Розничная сумма в валюте регламентированного учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПереоценки</Name>
					<Comment>Количество переоцененного товара</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена после переоценки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент или подразделение получатель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСкидки</Name>
					<Comment>Сумма скидки в валюте регл. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/InformationRegisters/ОграничениеАссортиментаПодразделения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ОграничениеАссортиментаПодразделения</Name>
			<Comment>Ограничение ассортимента подразделения компании</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Comment>Состояние товара в ассортименте подразделения</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияТовараВАссортименте</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена номенклатурной позиции</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентНаценки</Name>
					<Comment>Процент наценки для автоматического формирования цены продажи</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаРозничная</Name>
					<Comment>Розничная цена для переоценки остатков перед списанием</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>Ставка НДС по номенклатурной позиции</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БазовыйАссортимент</Name>
					<Comment>Товар вводится в базовый ассортимент</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидАссортимента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыАссортимента</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>итФорматАссортимента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФорматыКатегорий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ФорматыАссортиментаПодразделений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ФорматыАссортиментаПодразделений</Name>
			<Comment>Форматы ассортимента подразделений</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Формат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФорматыКатегорий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/ГруппыТоваровОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ГруппыТоваровОборудования</Name>
			<Comment>Группы товаров в оборудовании</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РежимЗаполнения</Name>
					<Comment>Режим заполнения группы товарами. 0-все товары, 1-только весовые товары, 2-только штучные, 3-ограничивается списком типов номенклатуры, 4-ограничиваться списком групп товаров</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическиЗаполнятьНовымТоваром</Name>
					<Comment>Если истина, то при записи нового товара он будет попадать в эту группу (если подходит по режиму заполнения)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаполнятьПропуски</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоУдаление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьПЛУНаЦенник</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьОграниченияПоГруппам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФиксироватьСобытия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогАрхива</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьВНомерЯчейкиАртикулНоменклатуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОграниченияЗаполненияГруппы</Name>
					<Comment>Ограничения заполнения группы</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипГруппаНоменклатуры</Name>
							<Comment>Тип или группа номенклатуры</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
								<v8:Type>cfg:CatalogRef.ТипыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/ТоварыВОборудовании/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура ТолькоВесовй(Команда)
	
	Элементы.ФормаТолькоВесовой.Пометка = НЕ Элементы.ФормаТолькоВесовой.Пометка;
	
КонецПроцедуры
// Модуль формы списка регистра "Товары в оборудовании"


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


// Обработчик результата оповещения при заполнении товарами в контексте сервера.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаСервере
Процедура ОбработкаРезультатаЗаполненияТоварамиНаСервере(РезультатОповещения, ДополнительныеПараметры=Неопределено)
	
	ГруппаТоваров = ДополнительныеПараметры.ГруппаТоваров;
	
	// Очистим все товары в случае выполнения команды очистки
	Если ДополнительныеПараметры.Свойство("ОчиститьВсеТовары") Тогда
		
		СтруктураОтбора=Новый Структура("ГруппаТоваров", ГруппаТоваров);
		ПустойНаборЗаписей = РегистрыСведений.ТоварыВОборудовании.СоздатьНаборЗаписей();
		ПустойНаборЗаписей.Отбор.ГруппаТоваров.Значение= ГруппаТоваров;
		ПустойНаборЗаписей.Отбор.ГруппаТоваров.Использование=Истина;
		ПустойНаборЗаписей.Записать(Истина);
		
		Возврат;
		
	КонецЕсли;
	
	// Формируем запрос
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ГруппаТоваров", ГруппаТоваров);
	
	РежимЗаполнения = ГруппаТоваров.РежимЗаполнения;
	
	// Добавим фильтр на группу товаров оборудования
	Если РежимЗаполнения = 3 Тогда
		Запрос.УстановитьПараметр("ТипыНоменклатуры", ГруппаТоваров.ОграниченияЗаполненияГруппы.ВыгрузитьКолонку("ТипГруппаНоменклатуры"));
	//ИначеЕсли РежимЗаполнения = 4 Тогда
	Иначе
		ГруппыНоменклатуры = ГруппаТоваров.ОграниченияЗаполненияГруппы.ВыгрузитьКолонку("ТипГруппаНоменклатуры");
		Запрос.УстановитьПараметр("ГруппыНоменклатуры", ГруппыНоменклатуры);
	КонецЕсли;
	
	ТекстЗапросаГДЕ = "";
	
	Если ДополнительныеПараметры.ИмяКоманды = "ЗаполнитьСкладскимиОстатками" ИЛИ ДополнительныеПараметры.ИмяКоманды = "ЗаполнитьОстаткамиПоГруппеНоменклатурыОбработанное" Тогда
		
		Если РезультатОповещения = Неопределено ИЛИ РезультатОповещения.Количество()=0 Тогда
			Возврат;
		КонецЕсли;
		
		Если РежимЗаполнения = 3 Тогда
			ТекстЗапросаГДЕ = "
			|	И ОстаткиТоваровКомпанииОстатки.Номенклатура.ТипНоменклатуры В (&ТипыНоменклатуры)";
		//ИначеЕсли РежимЗаполнения = 4 Тогда
		//	ТекстЗапросаГДЕ = "
		//	|	И ОстаткиТоваровКомпанииОстатки.Номенклатура В ИЕРАРХИИ (&ГруппыНоменклатуры)";
		ИначеЕсли РежимЗаполнения = 2 Тогда
			ТекстЗапросаГДЕ = "
			|	И (НЕ ОстаткиТоваровКомпанииОстатки.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Справочник.ТипыНоменклатуры.Услуга))
			|	И (НЕ ОстаткиТоваровКомпанииОстатки.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Справочник.ТипыНоменклатуры.Весовой))";
		ИначеЕсли РежимЗаполнения = 1 Тогда
			ТекстЗапросаГДЕ = "
			|	И ОстаткиТоваровКомпанииОстатки.Номенклатура.ТипНоменклатуры.Весовой = ИСТИНА";
		КонецЕсли;
		
		Если (НЕ РежимЗаполнения = 3) И ГруппыНоменклатуры.Количество()>0 Тогда
			ТекстЗапросаГДЕ = ТекстЗапросаГДЕ + "
			|	И ОстаткиТоваровКомпанииОстатки.Номенклатура В ИЕРАРХИИ (&ГруппыНоменклатуры)";
		КонецЕсли;
		
		ТекстОтбора = "";
		Если ДополнительныеПараметры.ИмяКоманды = "ЗаполнитьОстаткамиПоГруппеНоменклатурыОбработанное" И ДополнительныеПараметры.Свойство("ВыбГруппа") Тогда
			
			ГруппаНоменклатуры = ДополнительныеПараметры.ВыбГруппа;
			Если НЕ ГруппаНоменклатуры.ЭтоГруппа Тогда
				ВывестиСообщение(НСтр("RU = 'Необходимо выбрать группу номенклатуры !'"), ЭтотОбъект); 
				Возврат;
			КонецЕсли;
			
			Запрос.УстановитьПараметр("ВыбГруппа", ГруппаНоменклатуры);
			
			ТекстОтбора = " И Номенклатура В ИЕРАРХИИ (&ВыбГруппа)";
		КонецЕсли;
		
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	ОстаткиТоваровКомпанииОстатки.Номенклатура,
		|	ОстаткиТоваровКомпанииОстатки.Номенклатура.Наименование КАК Наименование,
		|	ОстаткиТоваровКомпанииОстатки.Номенклатура.ШтрихКодСвежесть КАК ШтрихКодСвежесть
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(,СкладКомпании В (&Склады)" + ТекстОтбора + ") КАК ОстаткиТоваровКомпанииОстатки
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	РегистрСведений.ТоварыВОборудовании КАК ТоварыВОборудовании
		|ПО
		|	ОстаткиТоваровКомпанииОстатки.Номенклатура = ТоварыВОборудовании.Номенклатура И
		|	ТоварыВОборудовании.ГруппаТоваров=&ГруппаТоваров" + ?(УчитыватьНаличиеШтрихКодаПриЗаполнении, "
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихКоды КАК ШтрихКоды
		|ПО
		|	ОстаткиТоваровКомпанииОстатки.Номенклатура = ШтрихКоды.Объект
		|	И ШтрихКоды.Запрет = ЛОЖЬ ", "") + "
		|ГДЕ
		|	ОстаткиТоваровКомпанииОстатки.КоличествоОстаток>0 И 
		|	ТоварыВОборудовании.Номенклатура ЕСТЬ NULL" + ТекстЗапросаГДЕ + "
		|УПОРЯДОЧИТЬ ПО
		|	ОстаткиТоваровКомпанииОстатки.Номенклатура.Наименование
		|";
		Запрос.УстановитьПараметр("Склады", РезультатОповещения);
		
	ИначеЕсли ДополнительныеПараметры.ИмяКоманды = "ЗаполнитьПоДокументуОбработанное" Тогда
		
		Если РежимЗаполнения = 3 Тогда
			ТекстЗапросаГДЕ = "
			|	И ДокументТовары.Номенклатура.ТипНоменклатуры В (&ТипыНоменклатуры)";
		//ИначеЕсли РежимЗаполнения = 4 Тогда
		//	ТекстЗапросаГДЕ = "
		//	|	И ДокументТовары.Номенклатура В ИЕРАРХИИ(&ГруппыНоменклатуры)";
		ИначеЕсли РежимЗаполнения = 2 Тогда
			ТекстЗапросаГДЕ = "
			|	И (НЕ ДокументТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Справочник.ТипыНоменклатуры.Услуга))
			|	И (НЕ ДокументТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Справочник.ТипыНоменклатуры.Весовой))";
		ИначеЕсли РежимЗаполнения = 1 Тогда
			ТекстЗапросаГДЕ = "
			|	И ДокументТовары.Номенклатура.ТипНоменклатуры.Весовой = ИСТИНА";
		КонецЕсли;
		
		Если (НЕ РежимЗаполнения = 3) И ГруппыНоменклатуры.Количество()>0 Тогда
			ТекстЗапросаГДЕ = ТекстЗапросаГДЕ + "
			|	И ДокументТовары.Номенклатура В ИЕРАРХИИ(&ГруппыНоменклатуры)";
		КонецЕсли;
		
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДокументТовары.Номенклатура,
		|	ДокументТовары.Номенклатура.Наименование КАК Наименование,
		|	ДокументТовары.Номенклатура.ШтрихКодСвежесть КАК ШтрихКодСвежесть
		|ИЗ
		|	Документ."+РезультатОповещения.Метаданные().Имя+".Товары КАК ДокументТовары
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	РегистрСведений.ТоварыВОборудовании КАК ТоварыВОборудовании
		|ПО
		|	ДокументТовары.Номенклатура = ТоварыВОборудовании.Номенклатура И
		|	ТоварыВОборудовании.ГруппаТоваров=&ГруппаТоваров" + ?(УчитыватьНаличиеШтрихКодаПриЗаполнении, "
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихКоды КАК ШтрихКоды
		|ПО
		|	ДокументТовары.Номенклатура = ШтрихКоды.Объект
		|	И ШтрихКоды.Запрет = ЛОЖЬ ", "") + "
		|ГДЕ
		|	ДокументТовары.Ссылка=&ДокСсылка И 
		|	ТоварыВОборудовании.Номенклатура ЕСТЬ NULL" + ТекстЗапросаГДЕ + "
		|УПОРЯДОЧИТЬ ПО
		|	ДокументТовары.Номенклатура.Наименование
		|";
		Запрос.УстановитьПараметр("ДокСсылка", РезультатОповещения);
		
	ИначеЕсли ДополнительныеПараметры.ИмяКоманды = "ЗаполнитьПоАссортиментуПодразделения" Тогда
		
		Если РежимЗаполнения = 3 Тогда
			ТекстЗапросаГДЕ = "
			|	И ОграничениеАссортиментаПодразделения.Номенклатура.ТипНоменклатуры В (&ТипыНоменклатуры)";
		//ИначеЕсли РежимЗаполнения = 4 Тогда
		//	ТекстЗапросаГДЕ = "
		//	|	И ОграничениеАссортиментаПодразделения.Номенклатура В ИЕРАРХИИ(&ГруппыНоменклатуры)";
		ИначеЕсли РежимЗаполнения = 2 Тогда
			ТекстЗапросаГДЕ = "
			|	И (НЕ ОграничениеАссортиментаПодразделения.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Справочник.ТипыНоменклатуры.Услуга))
			|	И (НЕ ОграничениеАссортиментаПодразделения.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Справочник.ТипыНоменклатуры.Весовой))";
		ИначеЕсли РежимЗаполнения = 1 Тогда
			ТекстЗапросаГДЕ = "
			|	И ОграничениеАссортиментаПодразделения.Номенклатура.ТипНоменклатуры.Весовой = ИСТИНА";
		КонецЕсли;
		
		Если (НЕ РежимЗаполнения = 3) И ГруппыНоменклатуры.Количество()>0 Тогда
			ТекстЗапросаГДЕ = ТекстЗапросаГДЕ + "
			|	И ОграничениеАссортиментаПодразделения.Номенклатура В ИЕРАРХИИ(&ГруппыНоменклатуры)";
		КонецЕсли;
		
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОграничениеАссортиментаПодразделения.Номенклатура,
		|	ОграничениеАссортиментаПодразделения.Номенклатура.Наименование КАК Наименование,
		|	ОграничениеАссортиментаПодразделения.Номенклатура.ШтрихКодСвежесть КАК ШтрихКодСвежесть
		|ИЗ
		|	РегистрСведений.ОграничениеАссортиментаПодразделения КАК ОграничениеАссортиментаПодразделения
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	РегистрСведений.ТоварыВОборудовании КАК ТоварыВОборудовании
		|ПО
		|	ОграничениеАссортиментаПодразделения.Номенклатура = ТоварыВОборудовании.Номенклатура И
		|	ТоварыВОборудовании.ГруппаТоваров=&ГруппаТоваров" + ?(УчитыватьНаличиеШтрихКодаПриЗаполнении, "
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихКоды КАК ШтрихКоды
		|ПО
		|	ОграничениеАссортиментаПодразделения.Номенклатура = ШтрихКоды.Объект
		|	И ШтрихКоды.Запрет = ЛОЖЬ ", "") + "
		|ГДЕ
		|	ОграничениеАссортиментаПодразделения.ПодразделениеКомпании=&СсылкаПодразделениеКомпании И 
		|	ТоварыВОборудовании.Номенклатура ЕСТЬ NULL" + ТекстЗапросаГДЕ + "
		|УПОРЯДОЧИТЬ ПО
		|	ОграничениеАссортиментаПодразделения.Номенклатура.Наименование
		|";
		
		Запрос.УстановитьПараметр("СсылкаПодразделениеКомпании", РезультатОповещения);
		
	ИначеЕсли ДополнительныеПараметры.ИмяКоманды = "ЗаполнитьПоАссортиментуФорматов" Тогда
		
		ТекстЗапросаГДЕФорматы = "";
		ТекстЗапросаГДЕСправочник = "";
		Если РежимЗаполнения = 3 Тогда
			ТекстЗапросаГДЕФорматы = "
			|	И ФорматыАссортиментаПодразделений.Номенклатура.ТипНоменклатуры В (&ТипыНоменклатуры)";
			ТекстЗапросаГДЕСправочник = "
			|	И ФорматыНоменклатура.Ссылка.ТипНоменклатуры В (&ТипыНоменклатуры)";
		//ИначеЕсли РежимЗаполнения = 4 Тогда
		//	ТекстЗапросаГДЕ = "
		//	|	И ПланированиеАссортиментаФорматов.Номенклатура В ИЕРАРХИИ(&ГруппыНоменклатуры)";
		ИначеЕсли РежимЗаполнения = 2 Тогда
			ТекстЗапросаГДЕФорматы = "
			|	И (НЕ ФорматыАссортиментаПодразделений.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Справочник.ТипыНоменклатуры.Услуга))
			|	И (НЕ ФорматыАссортиментаПодразделений.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Справочник.ТипыНоменклатуры.Весовой))";
			ТекстЗапросаГДЕСправочник = "
			|	И (НЕ ФорматыНоменклатура.Ссылка.ТипНоменклатуры = ЗНАЧЕНИЕ(Справочник.ТипыНоменклатуры.Услуга))
			|	И (НЕ ФорматыНоменклатура.Ссылка.ТипНоменклатуры = ЗНАЧЕНИЕ(Справочник.ТипыНоменклатуры.Весовой))";
		ИначеЕсли РежимЗаполнения = 1 Тогда
			ТекстЗапросаГДЕФорматы = "
			|	И ФорматыАссортиментаПодразделений.Номенклатура.ТипНоменклатуры.Весовой = ИСТИНА";
			ТекстЗапросаГДЕСправочник = "
			|	И ФорматыНоменклатура.Ссылка.ТипНоменклатуры.Весовой = ИСТИНА";
		КонецЕсли;
		
		Если (НЕ РежимЗаполнения = 1) И Элементы.ФормаТолькоВесовой.Пометка Тогда
			ТекстЗапросаГДЕФорматы =  ТекстЗапросаГДЕФорматы + "
			|	И ФорматыАссортиментаПодразделений.Номенклатура.ТипНоменклатуры.Весовой = ИСТИНА";
			ТекстЗапросаГДЕСправочник =  ТекстЗапросаГДЕСправочник + "
			|	И ФорматыНоменклатура.Ссылка.ТипНоменклатуры.Весовой = ИСТИНА";
		КонецЕсли;
		
		Если (НЕ РежимЗаполнения = 3) И ГруппыНоменклатуры.Количество()>0 Тогда
			ТекстЗапросаГДЕФорматы = ТекстЗапросаГДЕФорматы + "
			|	И ФорматыАссортиментаПодразделений.Номенклатура В ИЕРАРХИИ(&ГруппыНоменклатуры)";
			ТекстЗапросаГДЕСправочник = ТекстЗапросаГДЕСправочник + "
			|	И ФорматыНоменклатура.Ссылка В ИЕРАРХИИ(&ГруппыНоменклатуры)";
		КонецЕсли;
		//		Запрос.Текст = 
		//"ВЫБРАТЬ РАЗЛИЧНЫЕ
		//|	ФорматыАссортиментаПодразделений.Номенклатура КАК Номенклатура,
		//|	ФорматыАссортиментаПодразделений.Номенклатура.Наименование КАК Наименование,
		//|	ФорматыАссортиментаПодразделений.Номенклатура.ШтрихКодСвежесть КАК ШтрихКодСвежесть
		//|ИЗ
		//|	РегистрСведений.ФорматыАссортиментаПодразделений КАК ФорматыАссортиментаПодразделений
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварыВОборудовании КАК ТоварыВОборудовании
		//|		ПО ФорматыАссортиментаПодразделений.Номенклатура = ТоварыВОборудовании.Номенклатура
		//|			И (ТоварыВОборудовании.ГруппаТоваров = &ГруппаТоваров)" + ?(УчитыватьНаличиеШтрихКодаПриЗаполнении, "
		//|ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихКоды КАК ШтрихКоды
		//|ПО
		//|	ФорматыАссортиментаПодразделений.Номенклатура = ШтрихКоды.Объект
		//|	И ШтрихКоды.Запрет = ЛОЖЬ ", "") + "
		//|ГДЕ
		//|	ФорматыАссортиментаПодразделений.ПодразделениеКомпании = &ТекПодразделение
		//|	И ФорматыАссортиментаПодразделений.Формат В(&СсылкаФормат)
		//|	И ТоварыВОборудовании.Номенклатура ЕСТЬ NULL
		//|	И ФорматыАссортиментаПодразделений.Номенклатура.ЭтоГруппа = ЛОЖЬ" + ТекстЗапросаГДЕФорматы + "
		//|
		//|ОБЪЕДИНИТЬ
		//|
		//|ВЫБРАТЬ РАЗЛИЧНЫЕ
		//|	СправочникНоменклатура.Ссылка,
		//|	СправочникНоменклатура.Наименование,
		//|	СправочникНоменклатура.ШтрихКодСвежесть
		//|ИЗ
		//|	РегистрСведений.ФорматыАссортиментаПодразделений КАК ФорматыАссортиментаПодразделений
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварыВОборудовании КАК ТоварыВОборудовании
		//|		ПО ФорматыАссортиментаПодразделений.Номенклатура = ТоварыВОборудовании.Номенклатура
		//|			И (ТоварыВОборудовании.ГруппаТоваров = &ГруппаТоваров)
		//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
		//|		ПО ФорматыАссортиментаПодразделений.Номенклатура = СправочникНоменклатура.Родитель
		//|		ИЛИ ФорматыАссортиментаПодразделений.Номенклатура = СправочникНоменклатура.Родитель.Родитель
		//|		ИЛИ ФорматыАссортиментаПодразделений.Номенклатура = СправочникНоменклатура.Родитель.Родитель.Родитель" + ?(УчитыватьНаличиеШтрихКодаПриЗаполнении, "
		//|ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихКоды КАК ШтрихКоды
		//|ПО
		//|	СправочникНоменклатура.Ссылка = ШтрихКоды.Объект
		//|	И ШтрихКоды.Запрет = ЛОЖЬ ", "") + "
		//|ГДЕ
		//|	ФорматыАссортиментаПодразделений.ПодразделениеКомпании = &ТекПодразделение
		//|	И ФорматыАссортиментаПодразделений.Формат В(&СсылкаФормат)
		//|	И ТоварыВОборудовании.Номенклатура ЕСТЬ NULL
		//|	И СправочникНоменклатура.Ссылка.ЭтоГруппа = ЛОЖЬ
		//|	И ФорматыАссортиментаПодразделений.Номенклатура.ЭтоГруппа = ИСТИНА " + ТекстЗапросаГДЕСправочник + "
		//|
		//|УПОРЯДОЧИТЬ ПО
		//|	Наименование";
		
		
		Запрос.Текст = 		
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СправочникНоменклатура.Ссылка КАК Ссылка,
		|	СправочникНоменклатура.Наименование КАК Наименование,
		|	СправочникНоменклатура.ШтрихКодСвежесть КАК ШтрихКодСвежесть
		|ПОМЕСТИТЬ ФорматыНоменклатура
		|ИЗ
		|	РегистрСведений.ФорматыАссортиментаПодразделений КАК ФорматыАссортиментаПодразделений
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
		|		ПО (ФорматыАссортиментаПодразделений.Номенклатура = СправочникНоменклатура.Родитель
		|				ИЛИ ФорматыАссортиментаПодразделений.Номенклатура = СправочникНоменклатура.Родитель.Родитель
		|				ИЛИ ФорматыАссортиментаПодразделений.Номенклатура = СправочникНоменклатура.Родитель.Родитель.Родитель)
		|ГДЕ
		|	ФорматыАссортиментаПодразделений.ПодразделениеКомпании = &ТекПодразделение
		|	И ФорматыАссортиментаПодразделений.Формат В(&СсылкаФормат)
		|	И СправочникНоменклатура.Ссылка.ЭтоГруппа = ЛОЖЬ
		|	И ФорматыАссортиментаПодразделений.Номенклатура.ЭтоГруппа = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ФорматыАссортиментаПодразделений.Номенклатура КАК Номенклатура,
		|	ФорматыАссортиментаПодразделений.Номенклатура.Наименование КАК Наименование,
		|	ФорматыАссортиментаПодразделений.Номенклатура.ШтрихКодСвежесть КАК ШтрихКодСвежесть
		|ИЗ
		|	РегистрСведений.ФорматыАссортиментаПодразделений КАК ФорматыАссортиментаПодразделений
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварыВОборудовании КАК ТоварыВОборудовании
		|		ПО ФорматыАссортиментаПодразделений.Номенклатура = ТоварыВОборудовании.Номенклатура
		|			И (ТоварыВОборудовании.ГруппаТоваров = &ГруппаТоваров)" + ?(УчитыватьНаличиеШтрихКодаПриЗаполнении, "
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихКоды КАК ШтрихКоды
		|ПО
		|	ФорматыАссортиментаПодразделений.Номенклатура = ШтрихКоды.Объект
		|	И ШтрихКоды.Запрет = ЛОЖЬ ", "") + "
		|ГДЕ
		|	ФорматыАссортиментаПодразделений.ПодразделениеКомпании = &ТекПодразделение
		|	И ФорматыАссортиментаПодразделений.Формат В(&СсылкаФормат)
		|	И ТоварыВОборудовании.Номенклатура ЕСТЬ NULL
		|	И ФорматыАссортиментаПодразделений.Номенклатура.ЭтоГруппа = ЛОЖЬ" + ТекстЗапросаГДЕФорматы + "
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ФорматыНоменклатура.Ссылка,
		|	ФорматыНоменклатура.Наименование,
		|	ФорматыНоменклатура.ШтрихКодСвежесть
		|ИЗ
		|	ФорматыНоменклатура КАК ФорматыНоменклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварыВОборудовании КАК ТоварыВОборудовании
		|		ПО (ТоварыВОборудовании.ГруппаТоваров = &ГруппаТоваров)
		|			И ФорматыНоменклатура.Ссылка = ТоварыВОборудовании.Номенклатура" + ?(УчитыватьНаличиеШтрихКодаПриЗаполнении, "
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихКоды КАК ШтрихКоды
		|ПО
		|	ФорматыАссортиментаПодразделений.Номенклатура = ШтрихКоды.Объект
		|	И ШтрихКоды.Запрет = ЛОЖЬ ", "") + "
		|ГДЕ
		|	ТоварыВОборудовании.Номенклатура ЕСТЬ NULL" + ТекстЗапросаГДЕСправочник + "
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование";
				
		Запрос.УстановитьПараметр("СсылкаФормат", РезультатОповещения);
		Запрос.УстановитьПараметр("ТекПодразделение", ПараметрыСеанса.ПодразделениеКомпании);
		
	ИначеЕсли ДополнительныеПараметры.ИмяКоманды = "ЗаполнитьТолькоВесовымиТоварами" Тогда
		
		// Формируем текст запроса
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СпрНоменклатура.Ссылка КАК Номенклатура,
		|	СпрНоменклатура.Наименование КАК Наименование,
		|	СпрНоменклатура.ШтрихКодСвежесть КАК ШтрихКодСвежесть
		|ИЗ
		|	Справочник.Номенклатура КАК СпрНоменклатура
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	РегистрСведений.ТоварыВОборудовании КАК ТоварыВОборудовании
		|ПО
		|	СпрНоменклатура.Ссылка=ТоварыВОборудовании.Номенклатура И 
		|	ТоварыВОборудовании.ГруппаТоваров=&ГруппаТоваров" + ?(УчитыватьНаличиеШтрихКодаПриЗаполнении, "
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихКоды КАК ШтрихКоды
		|ПО
		|	СпрНоменклатура.Ссылка = ШтрихКоды.Объект
		|	И ШтрихКоды.Запрет = ЛОЖЬ ", "") + "
		|ГДЕ
		|	НЕ СпрНоменклатура.ЭтоГруппа
		|	И ТоварыВОборудовании.Номенклатура ЕСТЬ NULL
		|	И СпрНоменклатура.Ссылка.ТипНоменклатуры = ЗНАЧЕНИЕ(Справочник.ТипыНоменклатуры.Весовой)";
	Иначе
		
		Если РежимЗаполнения = 3 Тогда
			ТекстЗапросаГДЕ = "
			|	И СпрНоменклатура.ТипНоменклатуры В (&ТипыНоменклатуры)";
		//ИначеЕсли РежимЗаполнения = 4 Тогда
		//	ТекстЗапросаГДЕ = "
		//	|	И СпрНоменклатура.Ссылка В ИЕРАРХИИ(&ГруппыНоменклатуры)";
		ИначеЕсли РежимЗаполнения = 2 Тогда
			ТекстЗапросаГДЕ = "
			|	И (НЕ СпрНоменклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Справочник.ТипыНоменклатуры.Услуга))
			|	И (НЕ СпрНоменклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Справочник.ТипыНоменклатуры.Весовой))";
		ИначеЕсли РежимЗаполнения = 1 Тогда
			ТекстЗапросаГДЕ = "
			|	И СпрНоменклатура.ТипНоменклатуры.Весовой";
		КонецЕсли;
		
		Если (НЕ РежимЗаполнения = 3) И ГруппыНоменклатуры.Количество()>0 Тогда
			ТекстЗапросаГДЕ = ТекстЗапросаГДЕ + "
			|	И СпрНоменклатура.Ссылка В ИЕРАРХИИ(&ГруппыНоменклатуры)";
		КонецЕсли;
		
		// Формируем текст запроса
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СпрНоменклатура.Ссылка КАК Номенклатура,
		//|   Семья (Проект Свежесть)
		|	СпрНоменклатура.Ссылка.ШтрихКодСвежесть КАК ШтрихКодСвежесть,
		//
		|	СпрНоменклатура.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Номенклатура КАК СпрНоменклатура
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	РегистрСведений.ТоварыВОборудовании КАК ТоварыВОборудовании
		|ПО
		|	СпрНоменклатура.Ссылка=ТоварыВОборудовании.Номенклатура И 
		|	ТоварыВОборудовании.ГруппаТоваров=&ГруппаТоваров" + ?(УчитыватьНаличиеШтрихКодаПриЗаполнении, "
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихКоды КАК ШтрихКоды
		|ПО
		|	СпрНоменклатура.Ссылка = ШтрихКоды.Объект
		|	И ШтрихКоды.Запрет = ЛОЖЬ ", "") + "
		|ГДЕ
		|	НЕ СпрНоменклатура.ЭтоГруппа
		|	И ТоварыВОборудовании.Номенклатура ЕСТЬ NULL" + ТекстЗапросаГДЕ;
		
		Если ДополнительныеПараметры.ИмяКоманды = "ЗаполнитьПоГруппеНоменклатуры" ИЛИ ДополнительныеПараметры.ИмяКоманды = "ЗаполнитьОстаткамиПоГруппеНоменклатурыОбработанное" Тогда
			
			ГруппаНоменклатуры = ?(ДополнительныеПараметры.Свойство("ВыбГруппа"),ДополнительныеПараметры.ВыбГруппа, РезультатОповещения);
			
			Если ГруппаНоменклатуры = Неопределено Тогда
				Возврат;
			КонецЕсли;
			
			Если НЕ ГруппаНоменклатуры.ЭтоГруппа Тогда
				ВывестиСообщение(НСтр("RU = 'Необходимо выбрать группу номенклатуры !'"), ЭтотОбъект); 
				Возврат;
			КонецЕсли;
			
			Запрос.УстановитьПараметр("ВыбГруппа", ГруппаНоменклатуры);
			Запрос.Текст = Запрос.Текст + "
			|	И СпрНоменклатура.Ссылка В ИЕРАРХИИ (&ВыбГруппа)";
		КонецЕсли;
		
		Запрос.Текст = Запрос.Текст + "
		|УПОРЯДОЧИТЬ ПО
		|	СпрНоменклатура.Наименование
		|";
		
	КонецЕсли;
	
	Выборка=Запрос.Выполнить().Выбрать();
	
	НачатьТранзакцию();
	
	// Наложим блокировку на считываемые данные
	СтруктураПараметровБлокировки = Новый Структура("ТипТаблицы, ИмяТаблицы", "РегистрСведений", "ТоварыВОборудовании");
	ЗначенияБлокировки = Новый Соответствие;
	ЗначенияБлокировки.Вставить("ГруппаТоваров", ГруппаТоваров);
	
	Отказ = Ложь;
	ОбработкаСобытийДокументаСервер.УстановитьУправляемуюБлокировку(СтруктураПараметровБлокировки, ЗначенияБлокировки,,Отказ);
	Если Отказ Тогда
		ОтменитьТранзакцию();
		Возврат;
	КонецЕсли;
	
	НомерЯчейки = 0;
	КоличествоСвободныхЯчеек = 0;
	
	ЗаполнятьПропуски = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ГруппаТоваров, "ЗаполнятьПропуски");
	Если ЗаполнятьПропуски Тогда
		СвободныеНомераЯчеек = РегистрыСведений.ТоварыВОборудовании.ПолучитьСвободныеНомераЯчеек(ГруппаТоваров);
		КоличествоСвободныхЯчеек = СвободныеНомераЯчеек.Количество();
	Иначе
		НомерЯчейки = РегистрыСведений.ТоварыВОборудовании.ПолучитьМаксимальныйНомерЯчейки(ГруппаТоваров);
	КонецЕсли;
	
	НоменклатураВОборудовании = Новый Массив;
	
	ПередачаПослеПечати = ПолучитьЗначениеУчетнойПолитики(ПланыВидовХарактеристик.УчетныеПолитики.ПередачаВОборудованиеПослеПечати, Справочники.ГруппыТоваровОборудования.ПолучитьПодразделениеКомпанииПоГруппеТоваров(ГруппаТоваров));
	
	Пока Выборка.Следующий() Цикл
		
		Если КоличествоСвободныхЯчеек>0 Тогда
			ТекущийИндекс = КоличествоСвободныхЯчеек-1;
			НомерЯчейки = СвободныеНомераЯчеек[ТекущийИндекс];
			СвободныеНомераЯчеек.Удалить(ТекущийИндекс);
			КоличествоСвободныхЯчеек=Макс(0,КоличествоСвободныхЯчеек-1);
		Иначе
			НомерЯчейки = НомерЯчейки+1;
		КонецЕсли;
		
		НоваяЗапись = РегистрыСведений.ТоварыВОборудовании.СоздатьМенеджерЗаписи(); 
		НоваяЗапись.ГруппаТоваров   		 = ГруппаТоваров;
		НоваяЗапись.Номенклатура    		 = Выборка.Номенклатура;
		НоваяЗапись.НомерЯчейки     		 = НомерЯчейки;
		НоваяЗапись.ВыполненаПечатьЦенников = ?(ПередачаПослеПечати = Неопределено, Истина, НЕ ПередачаПослеПечати);
		НоваяЗапись.МоментИзменения 		 = ТекущаяДата();
		Попытка
			НоваяЗапись.Записать();
			НоменклатураВОборудовании.Добавить(Выборка.Номенклатура);
		Исключение
			Возврат;
			ОтменитьТранзакцию();
		КонецПопытки;
		
		// Семья (Проект Свежесть)
		Если ЗначениеЗаполнено(СокрЛП(Выборка.ШтрихКодСвежесть)) Тогда
			Если КоличествоСвободныхЯчеек>0 Тогда
				ТекущийИндекс = КоличествоСвободныхЯчеек-1;
				НомерЯчейки = СвободныеНомераЯчеек[ТекущийИндекс];
				СвободныеНомераЯчеек.Удалить(ТекущийИндекс);
			Иначе
				НомерЯчейки = НомерЯчейки+1;
			КонецЕсли;
			
			НоваяЗапись = РегистрыСведений.ТоварыВОборудовании.СоздатьМенеджерЗаписи(); 
			НоваяЗапись.ГруппаТоваров   = ГруппаТоваров;
			НоваяЗапись.Номенклатура    = Выборка.Номенклатура;
			НоваяЗапись.Штрихкод		= Выборка.ШтрихКодСвежесть;
			НоваяЗапись.НомерЯчейки     = НомерЯчейки;
			НоваяЗапись.МоментИзменения = ТекущаяДата();
			НоваяЗапись.ВыполненаПечатьЦенников = ?(ПередачаПослеПечати = Неопределено, Истина, НЕ ПередачаПослеПечати);
			Попытка
				НоваяЗапись.Записать();
				НоменклатураВОборудовании.Добавить(Выборка.Номенклатура);
			Исключение
				ОтменитьТранзакцию();
				Возврат;
			КонецПопытки;
		КонецЕсли;
		
	КонецЦикла;
	
	ДанныеУценки = РегистрыСведений.ТоварыВОборудовании.ПолучитьДанныеУценки(НоменклатураВОборудовании, ГруппаТоваров);
	Для Каждого ТекущаяСтрока Из ДанныеУценки Цикл
		
		Если КоличествоСвободныхЯчеек>0 Тогда
			ТекущийИндекс = КоличествоСвободныхЯчеек-1;
			НомерЯчейки = СвободныеНомераЯчеек[ТекущийИндекс];
			СвободныеНомераЯчеек.Удалить(ТекущийИндекс);
		Иначе
			НомерЯчейки = НомерЯчейки+1;
		КонецЕсли;
		
		ЗаписьТоварыВОборудовании = РегистрыСведений.ТоварыВОборудовании.СоздатьМенеджерЗаписи();
		ЗаписьТоварыВОборудовании.ГруппаТоваров   = ГруппаТоваров;
		ЗаписьТоварыВОборудовании.Номенклатура    = ТекущаяСтрока.Номенклатура;
		ЗаписьТоварыВОборудовании.ШтрихКод        = ТекущаяСтрока.ШтрихКод;
		ЗаписьТоварыВОборудовании.НомерЯчейки     = НомерЯчейки;
		ЗаписьТоварыВОборудовании.МоментИзменения = ТекущаяДатаСеанса();
		ЗаписьТоварыВОборудовании.ВыполненаПечатьЦенников = ?(ПередачаПослеПечати = Неопределено, Истина, НЕ ПередачаПослеПечати);
		Попытка
			ЗаписьТоварыВОборудовании.Записать();
		Исключение
			ОтменитьТранзакцию();
			Возврат;
		КонецПопытки;
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры // ОбработкаРезультатаЗаполненияТоварамиНаСервере()

// Обработчик результата оповещения при заполнении товарами.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура ОбработкаРезультатаЗаполненияТоварами(РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт
	
	// Проверяем статус закрытия окна параметров
	Если РезультатОповещения=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Проверяем выполнение текущей команды
	Если ДополнительныеПараметры.Свойство("ОчиститьВсеТовары") Тогда
		
		Если РезультатОповещения = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		
		РезультатОповещения = Неопределено;
		
	ИначеЕсли ДополнительныеПараметры.ИмяКоманды = "ЗаполнитьОстаткамиПоГруппеНоменклатуры" Тогда
		
		// Открываем форму выбора складов и формируем признак выполнения команды
		ДополнительныеПараметры.ИмяКоманды = "ЗаполнитьОстаткамиПоГруппеНоменклатурыОбработанное";
		ДополнительныеПараметры.Вставить("ВыбГруппа", РезультатОповещения);
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаРезультатаЗаполненияТоварами", ЭтотОбъект, ДополнительныеПараметры);
		
		ПараметрыОткрытия = Новый Структура();
		ПараметрыОткрытия.Вставить("РежимВыбора", ИСТИНА);
		ПараметрыОткрытия.Вставить("МножественныйВыбор", ИСТИНА);
		
		ОткрытьФорму("Справочник.СкладыКомпании.ФормаВыбора", ПараметрыОткрытия, ЭтотОбъект,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
		Возврат;
		
	ИначеЕсли ДополнительныеПараметры.ИмяКоманды = "ЗаполнитьПоДокументу" Тогда
		
		// Открываем форму списка документа и формируем признак выполненной команды
		ДополнительныеПараметры.ИмяКоманды = "ЗаполнитьПоДокументуОбработанное";
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаРезультатаЗаполненияТоварами", ЭтотОбъект, ДополнительныеПараметры);
		
		ПараметрыОткрытия = Новый Структура();
		ПараметрыОткрытия.Вставить("РежимВыбора", ИСТИНА);
		
		НаименованиеДокумента = РезультатОповещения.Значение;
		
		ОткрытьФорму("Документ."+НаименованиеДокумента+".ФормаВыбора", ПараметрыОткрытия, ЭтотОбъект,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
		Возврат;
		
	ИначеЕсли ДополнительныеПараметры.ИмяКоманды = "ВсяНоменклатура" Тогда
		
		// Обработаем команду заполнения всей номенклатурой
		Если РезультатОповещения = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		
		РезультатОповещения = Неопределено;
		
	ИначеЕсли ДополнительныеПараметры.ИмяКоманды = "ЗаполнитьТолькоВесовымиТоварами" Тогда
		
		// Обработаем команду заполнения всей номенклатурой
		Если РезультатОповещения = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		
		РезультатОповещения = Неопределено;
		
	КонецЕсли;
	
	// Обработаем результат в контексте сервера.
	ОбработкаРезультатаЗаполненияТоварамиНаСервере(РезультатОповещения, ДополнительныеПараметры);
	
	// Обновим отображение элементов.
	Элементы.Список.Обновить();
	
КонецПроцедуры // ОбработкаРезультатаЗаполненияТоварами()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СЛУЖЕБНОГО ПРОГРАММНОГО ИНТЕРФЕЙСА

// Обработчик события возникающего при нажатии программно добавленной кнопки в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаКомандыФормыНаСервере(ИмяКоманды, ПараметрыДействия=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомРегистраСервер.ОбработкаКомандыФормы(ЭтотОбъект, ИмяКоманды, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаКомандыФормыНаСервере()

// Обработчик события возникающего при нажатии программно добавленной кнопки.
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаКомандыФормы(Команда) Экспорт
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомРегистраКлиент.ОбработкаКомандыФормы(ЭтотОбъект, Команда, Элементы.Список.ТекущиеДанные, ЭтотОбъект.Окно, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаКомандыФормыНаСервере(Команда.Имя, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // Подключаемый_ОбработкаКомандыФормы()

// Обработчик события возникающего при оповещении данной формы о прекращении работы подчиненной в контексте сервера.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаСервере
Процедура ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомРегистраСервер.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаРезультатаОповещенияНаСервере()

// Обработчик события возникающего при выполнении оповещения данной формы о прекращении работы подчиненной.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаРезультатаОповещения(РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт
	
	// Вызываем общий обработчик события в контексте клиента
	Если НЕ УправлениеСпискомРегистраКлиент.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(РезультатОповещения);
	
КонецПроцедуры // Подключаемый_ОбработкаРезультатаОповещения()

// Отображает результат выполнения действия.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаКлиенте
Процедура ОбработкаРезультатаВыполненияДействия(ПараметрыДействия)
	
	// Вызываем общий обработчик результата выполнения действия
	УправлениеСпискомРегистраКлиент.ОбработкаРезультатаВыполненияДействия(ЭтотОбъект, ПараметрыДействия);
	
КонецПроцедуры // ОбработкаРезультатаВыполненияДействия()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

// Обработчик события кнопок заполнения товарами из подменю Заполнения.
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура Заполнить(Команда)
	
	// Создаем параметры описания оповещения
	ПараметрыОписанияОповещения = Новый Структура();
	ПараметрыОписанияОповещения.Вставить("Заполнение", Истина);
	ПараметрыОписанияОповещения.Вставить("ГруппаТоваров", ГруппаТоваровДляЗапроса);
	ПараметрыОписанияОповещения.Вставить("ИмяКоманды", Команда.Имя);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаРезультатаЗаполненияТоварами", ЭтотОбъект, ПараметрыОписанияОповещения);
	
	// Инициализируем структуру параметров открытия форм
	ПараметрыОткрытия = Новый Структура();
	
	// Выбираем команду для обработки
	Если Команда.Имя = "ВсяНоменклатура" Тогда
		ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Добавить в список всю номенклатуру ?'"),РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет,);
	КонецЕсли;
	
	Если (Команда.Имя = "ЗаполнитьПоГруппеНоменклатуры") Тогда
		
		ПараметрыОткрытия.Вставить("РежимВыбора", ИСТИНА);
		
		ОткрытьФорму("Справочник.Номенклатура.ФормаВыбораГруппы", ПараметрыОткрытия, ЭтотОбъект,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
	Если (Команда.Имя = "ЗаполнитьСкладскимиОстатками") Тогда
		
		ПараметрыОткрытия.Вставить("РежимВыбора", ИСТИНА);
		ПараметрыОткрытия.Вставить("МножественныйВыбор", ИСТИНА);
		
		ОткрытьФорму("Справочник.СкладыКомпании.ФормаВыбора", ПараметрыОткрытия, ЭтотОбъект,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
	Если (Команда.Имя = "ЗаполнитьОстаткамиПоГруппеНоменклатуры") Тогда
		
		ПараметрыОткрытия.Вставить("РежимВыбора", ИСТИНА);
		
		ОткрытьФорму("Справочник.Номенклатура.ФормаВыбораГруппы", ПараметрыОткрытия, ЭтотОбъект,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
	Если (Команда.Имя = "ЗаполнитьПоДокументу") Тогда
		
		СписокВыбора = Новый СписокЗначений();
		СписокВыбора.Добавить("ПеремещениеТоваров", НСтр("ru = 'Перемещение товаров'"));
		СписокВыбора.Добавить("ПоступлениеТоваров", НСтр("ru = 'Поступление товаров'"));
		
		СписокВыбора.ПоказатьВыборЭлемента(ОписаниеОповещения, НСтр("ru = 'Выберите вид документа'"));
		
	КонецЕсли;
	
	Если (Команда.Имя = "ЗаполнитьПоАссортиментуПодразделения") Тогда
		
		ПараметрыОткрытия.Вставить("РежимВыбора", ИСТИНА);
		
		ОткрытьФорму("Справочник.ПодразделенияКомпании.ФормаВыбора", ПараметрыОткрытия, ЭтотОбъект,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
	Если (Команда.Имя = "ЗаполнитьТолькоВесовымиТоварами") Тогда
		
		ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Добавить в список всю весовую номенклатуру?'"),РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет,);
		
	КонецЕсли;
	
	Если (Команда.Имя = "ЗаполнитьПоАссортиментуФорматов") Тогда
		
		ПараметрыОткрытия.Вставить("РежимВыбора", ИСТИНА);
		ПараметрыОткрытия.Вставить("МножественныйВыбор", ИСТИНА);
		ОткрытьФорму("Справочник.ФорматыКатегорий.ФормаВыбора", ПараметрыОткрытия, ЭтотОбъект,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;

КонецПроцедуры // Заполнить()

// Обработчик события нажатия кнопки использование штрихкода при заполнении.
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура УчитыватьНаличиеШтрихКодаПриЗаполнении(Команда)
	
	// Изменяем значение флага учета Штрихкода
	Элементы.ФормаУчитыватьНаличиеШтрихКодаПриЗаполнении.Пометка = НЕ Элементы.ФормаУчитыватьНаличиеШтрихКодаПриЗаполнении.Пометка;
	УчитыватьНаличиеШтрихКодаПриЗаполнении = Элементы.ФормаУчитыватьНаличиеШтрихКодаПриЗаполнении.Пометка ;
	
КонецПроцедуры // УчитыватьНаличиеШтрихКодаПриЗаполнении()

// Обработчик события нажатия кнопки Очистить все товары из подменю Заполнения.
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ОчиститьВсеТовары(Команда)
	
	// Создаем параметры описания оповещения
	ПараметрыОписанияОповещения = Новый Структура();
	ПараметрыОписанияОповещения.Вставить("ОчиститьВсеТовары", Истина);
	ПараметрыОписанияОповещения.Вставить("ГруппаТоваров", ГруппаТоваровДляЗапроса);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаРезультатаЗаполненияТоварами", ЭтотОбъект, ПараметрыОписанияОповещения);
	
	// Задаем вопрос пользователю
	ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Удалить все товары группы?'"), РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);
	
КонецПроцедуры // ОчиститьВсеТовары()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ДИНАМИЧЕСКОГО СПИСКА ФОРМЫ

// Обработчик события возникающего на клиенте при двойном щелчке мыши (нажатии Enter) в ячейке таблицы "Список".
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  ВыбраннаяСтрока      - Ссылка       - Значение выбранной строки.
//  Поле                 - ПолеФормы    - Активное поле.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	УправлениеСпискомРегистраКлиент.СписокВыбор(ЭтотОбъект, Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка);
	
КонецПроцедуры // СписокВыбор()

// Обработчик события возникающего на клиенте при активизации строки списка.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	// Вызываем общий обработчик события
	
	УправлениеСпискомРегистраКлиент.СписокПриАктивизацииСтроки(ЭтотОбъект, Элемент);
	
КонецПроцедуры // СписокПриАктивизацииСтроки()

// Обработчик события возникающего на клиенте при активизации строки списка выполняемый с задержкой.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_СписокПриАктивизацииСтроки()
	
	// Вызываем общий обработчик события
	УправлениеСпискомРегистраКлиент.СписокПриАктивизацииСтроки(ЭтотОбъект, Элементы.Список, ИСТИНА);
	
КонецПроцедуры // Подключаемый_СписокПриАктивизацииСтроки()

// Обработчик события возникающего на клиенте при активизации строки списка.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СписокПриАктивизацииЯчейки(Элемент)
	
	// Вызываем общий обработчик события
	УправлениеСпискомРегистраКлиент.СписокПриАктивизацииЯчейки(ЭтотОбъект, Элемент);
	
КонецПроцедуры // СписокПриАктивизацииЯчейки()

// Обработчик события возникающего на клиенте перед добавления строки в таблицу "Список".
//
// Параметры:
//  Элемент     - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ       - Булево       - Признак отказа от действия.
//  Копирование - Булево       - Определяет режим копирования.
//  Родитель    - Ссылка       - Ссылка на элемент, который будет использован при добавлении в качестве родителя.
//  Группа      - Булево       - Признак добавления группы.
//  Параметр    - Произвольный - Параметр команды, выполняемой при добавлении строки в таблицу.
//
&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	// Вызываем общий обработчик события
	УправлениеСпискомРегистраКлиент.СписокПередНачаломДобавления(ЭтотОбъект, Элемент, Отказ, Копирование, Родитель, Группа, Параметр);
	
КонецПроцедуры // СписокПередНачаломДобавления

// Обработчик события возникающего на клиенте перед началом изменения списка.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ   - Булево       - Признак отказа от действия.
//
&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	// Вызываем общий обработчик события
	УправлениеСпискомРегистраКлиент.СписокПередНачаломИзменения(ЭтотОбъект, Элемент, Отказ);
	
КонецПроцедуры // СписокПередНачаломИзменения()

// Обработчик события возникающего на клиенте после удаления строки списка.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СписокПослеУдаления(Элемент)
	
	// Вызываем общий обработчик события
	УправлениеСпискомРегистраКлиент.СписокПослеУдаления(ЭтотОбъект, Элемент);
	
КонецПроцедуры // СписокПослеУдаления()

// Обработчик события возникающего при сохранении пользовательских настроек в контексте сервера.
// 
// Параметры:
//  Элемент   - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Настройки - ПользовательскиеНастройкиКомпоновкиДанных - Сохраняемые настройки. 
//
&НаСервере
Процедура СписокПриСохраненииПользовательскихНастроекНаСервере(Элемент, Настройки)
	
	// Вызываем общий обработчик события
	УправлениеСпискомРегистраСервер.СписокПриСохраненииПользовательскихНастроекНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры // СписокПриСохраненииПользовательскихНастроекНаСервере()

// Обработчик события возникающего при восстановлении пользовательских настроек в контексте сервера.
// 
// Параметры:
//  Элемент   - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Настройки - ПользовательскиеНастройкиКомпоновкиДанных - Восстанавливаемые настройки. 
//
&НаСервере
Процедура СписокПриЗагрузкеПользовательскихНастроекНаСервере(Элемент, Настройки)
	
	// Вызываем общий обработчик события
	УправлениеСпискомРегистраСервер.СписокПриЗагрузкеПользовательскихНастроекНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры // СписокПриЗагрузкеПользовательскихНастроекНаСервере()

// Обработчик события возникающего на сервере при обновлении пользовательских настроек списка.
//
// Параметры:
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаСервере
Процедура СписокПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	УправлениеСпискомРегистраСервер.СписокПриОбновленииСоставаПользовательскихНастроекНаСервере(ЭтотОбъект, СтандартнаяОбработка);
	
КонецПроцедуры // СписокПриОбновленииСоставаПользовательскихНастроекНаСервере()

// Обработчик события вызывается на сервере после получения данных динамическим списком.
//
// Параметры:
//  ИмяЭлемента - Строка - Содержит имя таблицы формы, из которой вызван обработчик события.
//  Настройки   - НастройкиКомпоновкиДанных - Содержит копию полных настроек динамического списка.
//  Строки      - СтрокиДинамическогоСписка - Данные и оформление всех строк, получаемых в списке.
//
&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	// Вызываем общий обработчик события
	УправлениеСпискомРегистраСервер.СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки);
	
КонецПроцедуры // СписокПриПолученииДанныхНаСервере()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ФОРМЫ

// Обработчик события возникающего на сервере при создании формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Служит для определения параметра ГруппаТоваров в запросе из подменю "Заполнение".
	Если Параметры.Отбор.Свойство("ГруппаТоваров") Тогда
		ГруппаТоваровДляЗапроса = Параметры.Отбор.ГруппаТоваров;
	КонецЕсли;
	
	//Проверяем право доступа к командам заполнения товаров в оборудовании
	Элементы.ФормаГруппаЗаполнения.Доступность = ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ТоварыВОборудовании);
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомРегистраСервер.ПриСозданииНаСервере(ЭтотОбъект, Параметры, Отказ, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриСозданииНаСервере()

// Обработчик события возникающего на клиенте при открытии формы, до показа окна пользователю.
//
// Параметры:
//  Отказ - Булево - Признак отказа от создания формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомРегистраКлиент.ПриОткрытии(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	// Установим пометку
	Элементы.ФормаУчитыватьНаличиеШтрихКодаПриЗаполнении.Пометка = УчитыватьНаличиеШтрихКодаПриЗаполнении;
	
КонецПроцедуры // ПриОткрытии()

// Обработчик события возникающего на клиенте перед закрытием формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  ЗавершениеРаботы     - Булево - Признак закрытия формы в процессе завершения работы приложения.
//  ТекстПредупреждения  - Булево - Сообщение пользователю не завершенной работе в данном окне.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомРегистраКлиент.ПередЗакрытием(ЭтотОбъект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗакрытием()

// Обработчик события возникающего на клиенте при закрытии формы.
//
// Параметры:
//  ЗавершениеРаботы - Булево - Признак закрытия формы в процессе завершения работы приложения.
//
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомРегистраКлиент.ПриЗакрытии(ЭтотОбъект, ЗавершениеРаботы) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриЗакрытии()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить в контексте сервера.
//
// Параметры:
//  ИмяСобытия        - Строка    - Имя, идентифицирующее событие.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомРегистраСервер.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаОповещенияНаСервере()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить.
//
// Параметры:
//  ИмяСобытия - Строка       - Имя, идентифицирующее событие.
//  Параметр   - Произвольный - Параметр сообщения.
//  Источник   - Произвольный - Источник события.
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Производим подготовку параметров события для обработки в контексте сервера
	Если НЕ УправлениеСпискомРегистраКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ОбработкаОповещения()

// Обработчик события возникающего на клиенте при вызове метода ОповеститьОбАктивизации из формы-владельца.
//
// Параметры:
//  АктивныйОбъект - Произвольный     - Активный объект.
//  Источник       - УправляемаяФорма - Форма, источник сообщения.
//
&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомРегистраКлиент.ОбработкаАктивизации(ЭтотОбъект, АктивныйОбъект, Источник) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаАктивизации()

// Обработчик события возникающего на клиенте при записи объекта в одной из подчиненных форм.
//
// Параметры:
//  НовыйОбъект          - Произвольный     - Добавленный в подчиненной форме объект.
//  Источник             - УправляемаяФорма - Форма, источник сообщения.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомРегистраКлиент.ОбработкаЗаписиНового(ЭтотОбъект, НовыйОбъект, Источник, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаписиНового()

// Обработчик события возникающего на сервере при сохранении значений реквизитов и настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраняемых реквизитов и настроек формы.
//
&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеСпискомРегистраСервер.ПриСохраненииДанныхВНастройкахНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры // ПриСохраненииДанныхВНастройкахНаСервере()

// Обработчик события возникающего на сервере при восстановлении значений реквизитов из сохраненных настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраненных реквизитов и настроек формы.
//
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеСпискомРегистраСервер.ПриЗагрузкеДанныхИзНастроекНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры // ПриЗагрузкеДанныхИзНастроекНаСервере()

&НаСервере
Процедура УстановитьМоментИзмененияНаСервере()
	
	Для Каждого Строка Из Элементы.Список.ВыделенныеСтроки Цикл
		Запись = РегистрыСведений.ТоварыВОборудовании.СоздатьМенеджерЗаписи();
		Запись.ГруппаТоваров   = Строка.ГруппаТоваров;
		Запись.Номенклатура    = Строка.Номенклатура;
		Запись.Штрихкод        = Строка.Штрихкод;
		Запись.Прочитать();
		Запись.МоментИзменения = ТекущаяДата();
		Запись.Записать();
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьМоментИзменения(Команда)
	УстановитьМоментИзмененияНаСервере();
	ОбновитьИнтерфейс();
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ
